Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/PIC32CX-MTSH/atdf/PIC32CX1025MTSH128.atdf
        <register caption="Channel Enable Register" name="ADC_CHER" offset="0x10" rw="W" size="4">
          <bitfield caption="Channel 0 Enable" mask="0x00000001" name="CH0"/>
          <bitfield caption="Channel 1 Enable" mask="0x00000002" name="CH1"/>
          <bitfield caption="Channel 2 Enable" mask="0x00000004" name="CH2"/>
          <bitfield caption="Channel 3 Enable" mask="0x00000008" name="CH3"/>
          <bitfield caption="Channel 4 Enable" mask="0x00000010" name="CH4"/>
          <bitfield caption="Channel 5 Enable" mask="0x00000020" name="CH5"/>
          <bitfield caption="Channel 6 Enable" mask="0x00000040" name="CH6"/>
          <bitfield caption="Channel 7 Enable" mask="0x00000080" name="CH7"/>
        </register>
        <register caption="Channel Disable Register" name="ADC_CHDR" offset="0x14" rw="W" size="4">
          <bitfield caption="Channel 0 Disable" mask="0x00000001" name="CH0"/>
          <bitfield caption="Channel 1 Disable" mask="0x00000002" name="CH1"/>
          <bitfield caption="Channel 2 Disable" mask="0x00000004" name="CH2"/>
          <bitfield caption="Channel 3 Disable" mask="0x00000008" name="CH3"/>
          <bitfield caption="Channel 4 Disable" mask="0x00000010" name="CH4"/>
          <bitfield caption="Channel 5 Disable" mask="0x00000020" name="CH5"/>
          <bitfield caption="Channel 6 Disable" mask="0x00000040" name="CH6"/>
          <bitfield caption="Channel 7 Disable" mask="0x00000080" name="CH7"/>
        </register>
        <register caption="Channel Status Register" name="ADC_CHSR" offset="0x18" rw="R" size="4">
          <bitfield caption="Channel 0 Status" mask="0x00000001" name="CH0"/>
          <bitfield caption="Channel 1 Status" mask="0x00000002" name="CH1"/>
          <bitfield caption="Channel 2 Status" mask="0x00000004" name="CH2"/>
          <bitfield caption="Channel 3 Status" mask="0x00000008" name="CH3"/>
          <bitfield caption="Channel 4 Status" mask="0x00000010" name="CH4"/>
          <bitfield caption="Channel 5 Status" mask="0x00000020" name="CH5"/>
          <bitfield caption="Channel 6 Status" mask="0x00000040" name="CH6"/>
          <bitfield caption="Channel 7 Status" mask="0x00000080" name="CH7"/>
        </register>
        <register caption="Last Converted Data Register" name="ADC_LCDR" offset="0x20" rw="R" size="4">
          <mode name="DEFAULT"/>
          <mode name="NO_OSR"/>
          <bitfield caption="Last Data Converted" mask="0x0000FFFF" name="LDATA" modes="DEFAULT"/>
          <bitfield caption="Channel Number in Oversampling Mode" mask="0x1F000000" name="CHNBOSR" modes="DEFAULT"/>
          <bitfield caption="Last Data Converted when No Oversampling" mask="0x00000FFF" name="NO_OSR_LDATA" modes="NO_OSR"/>
          <bitfield caption="Channel Number when No Oversampling" mask="0x0000F000" name="NO_OSR_CHNB" modes="NO_OSR"/>
        </register>
        <register caption="Interrupt Enable Register" name="ADC_IER" offset="0x24" rw="W" size="4">
          <bitfield caption="Receive Ready Interrupt Enable" mask="0x00000001" name="RXRDY"/>
          <bitfield caption="Receive FIFO Empty Interrupt Enable" mask="0x00000002" name="RXEMPTY"/>
          <bitfield caption="Receive FIFO Full Interrupt Enable" mask="0x00000004" name="RXFULL"/>
          <bitfield caption="Receive FIFO Chunk Interrupt Enable" mask="0x00000008" name="RXCHUNK"/>
          <bitfield caption="Receive Under Flow Interrupt Enable" mask="0x00000010" name="RXUDR"/>
          <bitfield caption="Receive Over Flow Interrupt Enable" mask="0x00000020" name="RXOVR"/>
          <bitfield caption="Supply Monitor Event Interrupt Enable" mask="0x00000040" name="SMEV"/>
          <bitfield caption="End Of Sequence Interrupt Enable" mask="0x00040000" name="EOS"/>
          <bitfield caption="Temperature Change Interrupt Enable" mask="0x00080000" name="TEMPCHG"/>
          <bitfield caption="Data Ready Interrupt Enable" mask="0x01000000" name="DRDY"/>
          <bitfield caption="General Overrun Error Interrupt Enable" mask="0x02000000" name="GOVRE"/>
          <bitfield caption="Comparison Event Interrupt Enable" mask="0x04000000" name="COMPE"/>
          <bitfield caption="End of Receive Transfer Interrupt Enable" mask="0x08000000" name="ENDRX"/>
          <bitfield caption="Receive Buffer Full Interrupt Enable" mask="0x10000000" name="RXBUFF"/>
        </register>
        <register caption="Interrupt Disable Register" name="ADC_IDR" offset="0x28" rw="W" size="4">
          <bitfield caption="Receive Ready Interrupt Disable" mask="0x00000001" name="RXRDY"/>
          <bitfield caption="Receive FIFO Empty Interrupt Disable" mask="0x00000002" name="RXEMPTY"/>
          <bitfield caption="Receive FIFO Full Interrupt Disable" mask="0x00000004" name="RXFULL"/>
          <bitfield caption="Receive FIFO Chunk Interrupt Disable" mask="0x00000008" name="RXCHUNK"/>
          <bitfield caption="Receive Under Flow Interrupt Disable" mask="0x00000010" name="RXUDR"/>
          <bitfield caption="Receive Over Flow Interrupt Disable" mask="0x00000020" name="RXOVR"/>
          <bitfield caption="Supply Monitor Event Interrupt Disable" mask="0x00000040" name="SMEV"/>
          <bitfield caption="End Of Sequence Interrupt Disable" mask="0x00040000" name="EOS"/>
          <bitfield caption="Temperature Change Interrupt Disable" mask="0x00080000" name="TEMPCHG"/>
          <bitfield caption="Data Ready Interrupt Disable" mask="0x01000000" name="DRDY"/>
          <bitfield caption="General Overrun Error Interrupt Disable" mask="0x02000000" name="GOVRE"/>
          <bitfield caption="Comparison Event Interrupt Disable" mask="0x04000000" name="COMPE"/>
          <bitfield caption="End of Receive Transfer Interrupt Disable" mask="0x08000000" name="ENDRX"/>
          <bitfield caption="Receive Buffer Full Interrupt Disable" mask="0x10000000" name="RXBUFF"/>
        </register>
        <register caption="Interrupt Mask Register" name="ADC_IMR" offset="0x2C" rw="R" size="4">
          <bitfield caption="Receive Ready Interrupt Mask" mask="0x00000001" name="RXRDY"/>
          <bitfield caption="Receive FIFO Empty Interrupt Mask" mask="0x00000002" name="RXEMPTY"/>
          <bitfield caption="Receive FIFO Full Interrupt Mask" mask="0x00000004" name="RXFULL"/>
          <bitfield caption="Receive FIFO Chunk Interrupt Mask" mask="0x00000008" name="RXCHUNK"/>
          <bitfield caption="Receive Under Flow Interrupt Mask" mask="0x00000010" name="RXUDR"/>
          <bitfield caption="Receive Over Flow Interrupt Mask" mask="0x00000020" name="RXOVR"/>
          <bitfield caption="Supply Monitor Event Interrupt Mask" mask="0x00000040" name="SMEV"/>
          <bitfield caption="End Of Sequence Interrupt Mask" mask="0x00040000" name="EOS"/>
          <bitfield caption="Temperature Change Interrupt Mask" mask="0x00080000" name="TEMPCHG"/>
          <bitfield caption="Data Ready Interrupt Mask" mask="0x01000000" name="DRDY"/>
          <bitfield caption="General Overrun Error Interrupt Mask" mask="0x02000000" name="GOVRE"/>
          <bitfield caption="Comparison Event Interrupt Mask" mask="0x04000000" name="COMPE"/>
          <bitfield caption="End of Receive Transfer Interrupt Mask" mask="0x08000000" name="ENDRX"/>
          <bitfield caption="Receive Buffer Full Interrupt Mask" mask="0x10000000" name="RXBUFF"/>
        </register>
