Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/PIC32CX-MTSH/atdf/PIC32CX1025MTSH128.atdf
      <value-group caption="Embedded Processor" name="CHIPID_CIDR__EPROC">
        <value caption="Cortex-M7" name="SAMx7" value="0x0"/>
        <value caption="ARM946ES" name="ARM946ES" value="0x1"/>
        <value caption="ARM7TDMI" name="ARM7TDMI" value="0x2"/>
        <value caption="Cortex-M3" name="CM3" value="0x3"/>
        <value caption="ARM920T" name="ARM920T" value="0x4"/>
        <value caption="ARM926EJS" name="ARM926EJS" value="0x5"/>
        <value caption="Cortex-A5" name="CA5" value="0x6"/>
        <value caption="Cortex-M4" name="CM4" value="0x7"/>
      </value-group>
      <value-group caption="Nonvolatile Program Memory Size" name="CHIPID_CIDR__NVPSIZ">
        <value caption="None" name="NONE" value="0x0"/>
        <value caption="8 Kbytes" name="_8K" value="0x1"/>
        <value caption="16 Kbytes" name="_16K" value="0x2"/>
        <value caption="32 Kbytes" name="_32K" value="0x3"/>
        <value caption="64 Kbytes" name="_64K" value="0x5"/>
        <value caption="128 Kbytes" name="_128K" value="0x7"/>
        <value caption="160 Kbytes" name="_160K" value="0x8"/>
        <value caption="256 Kbytes" name="_256K" value="0x9"/>
        <value caption="512 Kbytes" name="_512K" value="0xA"/>
        <value caption="1024 Kbytes" name="_1024K" value="0xC"/>
        <value caption="2048 Kbytes" name="_2048K" value="0xE"/>
      </value-group>
      <value-group caption="Second Nonvolatile Program Memory Size" name="CHIPID_CIDR__NVPSIZ2">
        <value caption="None" name="NONE" value="0x0"/>
        <value caption="8 Kbytes" name="_8K" value="0x1"/>
        <value caption="16 Kbytes" name="_16K" value="0x2"/>
        <value caption="32 Kbytes" name="_32K" value="0x3"/>
        <value caption="64 Kbytes" name="_64K" value="0x5"/>
        <value caption="128 Kbytes" name="_128K" value="0x7"/>
        <value caption="256 Kbytes" name="_256K" value="0x9"/>
        <value caption="512 Kbytes" name="_512K" value="0xA"/>
        <value caption="1024 Kbytes" name="_1024K" value="0xC"/>
        <value caption="2048 Kbytes" name="_2048K" value="0xE"/>
      </value-group>
      <value-group caption="Internal SRAM Size" name="CHIPID_CIDR__SRAMSIZ">
        <value caption="48 Kbytes" name="_48K" value="0x0"/>
        <value caption="192 Kbytes" name="_192K" value="0x1"/>
        <value caption="384 Kbytes" name="_384K" value="0x2"/>
        <value caption="6 Kbytes" name="_6K" value="0x3"/>
        <value caption="24 Kbytes" name="_24K" value="0x4"/>
        <value caption="4 Kbytes" name="_4K" value="0x5"/>
        <value caption="80 Kbytes" name="_80K" value="0x6"/>
        <value caption="160 Kbytes" name="_160K" value="0x7"/>
        <value caption="8 Kbytes" name="_8K" value="0x8"/>
        <value caption="16 Kbytes" name="_16K" value="0x9"/>
        <value caption="32 Kbytes" name="_32K" value="0xA"/>
        <value caption="64 Kbytes" name="_64K" value="0xB"/>
        <value caption="128 Kbytes" name="_128K" value="0xC"/>
        <value caption="256 Kbytes" name="_256K" value="0xD"/>
        <value caption="96 Kbytes" name="_96K" value="0xE"/>
        <value caption="512 Kbytes" name="_512K" value="0xF"/>
      </value-group>
      <value-group caption="Architecture Identifier" name="CHIPID_CIDR__ARCH">
        <value caption="Dual Core, Single Phase, High Accuracy (128-lead version)" name="PIC32CXMTSH128" value="0xC3"/>
        <value caption="Dual Core (128-lead version)" name="PIC32CXMTC128" value="0xC5"/>
        <value caption="Single Core (64-lead version)" name="PIC32CXMTG64" value="0xC6"/>
        <value caption="Single Core (128-lead version)" name="PIC32CXMTG128" value="0xC8"/>
      </value-group>
      <value-group caption="Nonvolatile Program Memory Type" name="CHIPID_CIDR__NVPTYP">
        <value caption="ROM" name="ROM" value="0x0"/>
        <value caption="ROMless or on-chip Flash" name="ROMLESS" value="0x1"/>
        <value caption="Embedded Flash Memory" name="FLASH" value="0x2"/>
        <value caption="ROM and Embedded Flash Memory - NVPSIZ is ROM size - NVPSIZ2 is Flash size" name="ROM_FLASH" value="0x3"/>
        <value caption="SRAM emulating ROM" name="SRAM" value="0x4"/>
      </value-group>
    </module>
    <module caption="Cortex-M Cache Controller" name="CMCC" id="11108" version="I">
      <register-group name="CMCC">
        <register caption="Cache Controller Type Register" name="CMCC_TYPE" offset="0x00" rw="R" size="4">
          <bitfield caption="Access Port Access Allowed" mask="0x00000001" name="AP"/>
          <bitfield caption="Dynamic Clock Gating Supported" mask="0x00000002" name="GCLK"/>
          <bitfield caption="Random Selection Policy Supported" mask="0x00000004" name="RANDP"/>
          <bitfield caption="Least Recently Used Policy Supported" mask="0x00000008" name="LRUP"/>
          <bitfield caption="Random Selection Policy Supported" mask="0x00000010" name="RRP"/>
          <bitfield caption="Number of Ways" mask="0x00000060" name="WAYNUM" values="CMCC_TYPE__WAYNUM"/>
          <bitfield caption="Lockdown Supported" mask="0x00000080" name="LCKDOWN"/>
          <bitfield caption="Data Cache Size" mask="0x00000700" name="CSIZE" values="CMCC_TYPE__CSIZE"/>
          <bitfield caption="Cache LIne Size" mask="0x00003800" name="CLSIZE" values="CMCC_TYPE__CLSIZE"/>
        </register>
        <register caption="Configuration Register" name="CMCC_CFG" offset="0x04" rw="RW" size="4">
          <bitfield caption="Disable Clock Gating" mask="0x00000001" name="GCLKDIS"/>
          <bitfield caption="Instruction Caching Disable" mask="0x00000002" name="ICDIS"/>
          <bitfield caption="Data Caching Disable" mask="0x00000004" name="DCDIS"/>
          <bitfield caption="Programmable Cache Size" mask="0x00000070" name="PRGCSIZE"/>
          <bitfield caption="Configuration Lock Until Next System Reset (Write-once)" mask="0x00000100" name="LOCK"/>
        </register>
        <register caption="Control Register" name="CMCC_CTRL" offset="0x08" rw="W" size="4">
          <bitfield caption="Cache Controller Enable" mask="0x00000001" name="CEN"/>
          <bitfield caption="Control Lock Until Next System Reset (Write-once)" mask="0x00000100" name="LOCK"/>
        </register>
        <register caption="Status Register" name="CMCC_SR" offset="0x0C" rw="R" size="4">
          <bitfield caption="Cache Controller Status" mask="0x00000001" name="CSTS"/>
        </register>
