Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/PIC32CX-MTSH/atdf/PIC32CX1025MTSH128.atdf
        <register caption="Channel A Comparison Configuration 2" name="EMAFE_CHA_CFG2" offset="0x48" rw="RW" size="4">
          <bitfield caption="Threshold 2 for Channel A" mask="0x00FFFFFF" name="THRESH2"/>
        </register>
        <register caption="Channel B Comparison Configuration 2" name="EMAFE_CHB_CFG2" offset="0x4C" rw="RW" size="4">
          <bitfield caption="Threshold 2 for Channel B" mask="0x00FFFFFF" name="THRESH2"/>
        </register>
        <register caption="Interrupt Enable Register" name="EMAFE_IER" offset="0x50" rw="W" size="4">
          <bitfield caption="Data Ready Interrupt Enable" mask="0x00000001" name="DRDY"/>
          <bitfield caption="Receive Underflow Flow Interrupt Enable" mask="0x00000002" name="RXUDR"/>
          <bitfield caption="Receive FIFO Full Interrupt Enable" mask="0x00000004" name="RXFULL"/>
          <bitfield caption="Receive FIFO Empty Interrupt Enable" mask="0x00000008" name="RXEMPTY"/>
          <bitfield caption="Channel Data Change Interrupt Enable" mask="0x00000010" name="CHCHG"/>
          <bitfield caption="Comparison Flag Interrupt Enable" mask="0x00000020" name="CHDIFF"/>
          <bitfield caption="Parity Error Interrupt Enable" mask="0x00000040" name="PARERROR"/>
          <bitfield caption="PDC Receive Transfer End Interrupt Enable" mask="0x00000080" name="ENDRX"/>
          <bitfield caption="PDC Receive Buffer Full Interrupt Enable" mask="0x00000100" name="RXBUFF"/>
          <bitfield caption="Channel A Event Interrupt Enable" mask="0x00000200" name="CHAEVT"/>
          <bitfield caption="Channel B Event Interrupt Enable" mask="0x00000400" name="CHBEVT"/>
        </register>
        <register caption="Interrupt Disable Register" name="EMAFE_IDR" offset="0x54" rw="W" size="4">
          <bitfield caption="Data Ready Interrupt Disable" mask="0x00000001" name="DRDY"/>
          <bitfield caption="Receive Underflow Flow Interrupt Disable" mask="0x00000002" name="RXUDR"/>
          <bitfield caption="Receive FIFO Full Interrupt Disable" mask="0x00000004" name="RXFULL"/>
          <bitfield caption="Receive FIFO Empty Interrupt Disable" mask="0x00000008" name="RXEMPTY"/>
          <bitfield caption="Channel Data Change Interrupt Disable" mask="0x00000010" name="CHCHG"/>
          <bitfield caption="Comparison Flag Interrupt Disable" mask="0x00000020" name="CHDIFF"/>
          <bitfield caption="Parity Error Interrupt Disable" mask="0x00000040" name="PARERROR"/>
          <bitfield caption="PDC Receive Transfer End Interrupt Disable" mask="0x00000080" name="ENDRX"/>
          <bitfield caption="PDC Receive Buffer Full Interrupt Disable" mask="0x00000100" name="RXBUFF"/>
          <bitfield caption="Threshold Channel A Interrupt Disable" mask="0x00000200" name="CHAEVT"/>
          <bitfield caption="Threshold Channel B Interrupt Disable" mask="0x00000400" name="CHBEVT"/>
        </register>
        <register caption="Interrupt Mask Register" name="EMAFE_IMR" offset="0x58" rw="R" size="4">
          <bitfield caption="Data Ready Interrupt Mask" mask="0x00000001" name="DRDY"/>
          <bitfield caption="Receive Underflow Flow Interrupt Mask" mask="0x00000002" name="RXUDR"/>
          <bitfield caption="Receive FIFO Full Interrupt Mask" mask="0x00000004" name="RXFULL"/>
          <bitfield caption="Receive FIFO Empty Interrupt Mask" mask="0x00000008" name="RXEMPTY"/>
          <bitfield caption="Channel Data Change Interrupt Mask" mask="0x00000010" name="CHCHG"/>
          <bitfield caption="Comparison Flag Interrupt Mask" mask="0x00000020" name="CHDIFF"/>
          <bitfield caption="Parity Error Interrupt Mask" mask="0x00000040" name="PARERROR"/>
          <bitfield caption="PDC Receive Transfer End Interrupt Mask" mask="0x00000080" name="ENDRX"/>
          <bitfield caption="PDC Receive Buffer Full Interrupt Mask" mask="0x00000100" name="RXBUFF"/>
          <bitfield caption="Channel A Interrupt Mask" mask="0x00000200" name="CHAEVT"/>
          <bitfield caption="Channel B Interrupt Mask" mask="0x00000400" name="CHBEVT"/>
        </register>
        <register caption="Interrupt Status Register" name="EMAFE_ISR" offset="0x5C" rw="R" size="4">
          <bitfield caption="Data Ready (cleared on read)" mask="0x00000001" name="DRDY"/>
          <bitfield caption="Receive Under Flow (cleared on read)" mask="0x00000002" name="RXUDR"/>
          <bitfield caption="Receive FIFO Full (cleared on read)" mask="0x00000004" name="RXFULL"/>
          <bitfield caption="Receive FIFO Empty (cleared on read)" mask="0x00000008" name="RXEMPTY"/>
          <bitfield caption="Channel Data Variation Detection Event (cleared on read)" mask="0x00000010" name="CHCHG"/>
          <bitfield caption="Channel Difference Comparison Event (cleared on read)" mask="0x00000020" name="CHDIFF"/>
          <bitfield caption="Parity Error Event (cleared on read)" mask="0x00000040" name="PARERROR"/>
          <bitfield caption="PDC Receive Transfer End Event (cleared by writing EMAFE_RCR or EMAFE_RNCR)" mask="0x00000080" name="ENDRX"/>
          <bitfield caption="PDC Receive Buffer Full Event (cleared by writing EMAFE_RCR or EMAFE_RNCR)" mask="0x00000100" name="RXBUFF"/>
          <bitfield caption="Channel A Event (cleared on read)" mask="0x00000200" name="CHAEVT"/>
          <bitfield caption="Channel B Event (cleared on read)" mask="0x00000400" name="CHBEVT"/>
        </register>
        <register caption="Status Register" name="EMAFE_SR" offset="0x60" rw="R" size="4">
          <bitfield caption="Event on Channel A" mask="0x00000001" name="CHAEVT"/>
          <bitfield caption="Event on Channel B" mask="0x00000002" name="CHBEVT"/>
        </register>
        <register caption="Write Protection Mode Register" name="EMAFE_WPMR" offset="0xE4" rw="RW" size="4">
          <bitfield caption="Write Protection Configuration Enable" mask="0x00000001" name="WPCFEN"/>
          <bitfield caption="Write Protection Interrupt Enable" mask="0x00000002" name="WPITEN"/>
          <bitfield caption="Write Protection Control" mask="0x00000004" name="WPCTRL"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="EMAFE_WPMR__WPKEY"/>
        </register>
        <register caption="Write Protection Status Register" name="EMAFE_WPSR" offset="0xE8" rw="R" size="4">
          <bitfield caption="Write Protection Violation Status" mask="0x00000001" name="WPVS"/>
          <bitfield caption="Write Protection Violation Source" mask="0x00FFFF00" name="WPVSRC"/>
        </register>
        <register caption="Version Register" name="EMAFE_VERSION" offset="0xFC" rw="R" size="4">
          <bitfield caption="Version of the Hardware Module" mask="0x0000FFFF" name="VERSION"/>
          <bitfield caption="Metal Fix Number" mask="0x000F0000" name="MFN"/>
        </register>
        <register caption="Receive Pointer Register" name="EMAFE_RPR" offset="0x100" rw="RW" size="4">
          <bitfield caption="Receive Pointer Register" mask="0xFFFFFFFF" name="RXPTR"/>
        </register>
        <register caption="Receive Counter Register" name="EMAFE_RCR" offset="0x104" rw="RW" size="4">
          <bitfield caption="Receive Counter Register" mask="0x0000FFFF" name="RXCTR"/>
        </register>
        <register caption="Receive Next Pointer Register" name="EMAFE_RNPR" offset="0x110" rw="RW" size="4">
          <bitfield caption="Receive Next Pointer" mask="0xFFFFFFFF" name="RXNPTR"/>
        </register>
        <register caption="Receive Next Counter Register" name="EMAFE_RNCR" offset="0x114" rw="RW" size="4">
          <bitfield caption="Receive Next Counter" mask="0x0000FFFF" name="RXNCTR"/>
        </register>
        <register caption="Transfer Control Register" name="EMAFE_PTCR" offset="0x120" rw="W" size="4">
          <bitfield caption="Receiver Transfer Enable" mask="0x00000001" name="RXTEN"/>
          <bitfield caption="Receiver Transfer Disable" mask="0x00000002" name="RXTDIS"/>
          <bitfield caption="Transmitter Transfer Enable" mask="0x00000100" name="TXTEN"/>
          <bitfield caption="Transmitter Transfer Disable" mask="0x00000200" name="TXTDIS"/>
          <bitfield caption="Receiver Circular Buffer Enable" mask="0x00010000" name="RXCBEN"/>
          <bitfield caption="Receiver Circular Buffer Disable" mask="0x00020000" name="RXCBDIS"/>
          <bitfield caption="Transmitter Circular Buffer Enable" mask="0x00040000" name="TXCBEN"/>
          <bitfield caption="Transmitter Circular Buffer Disable" mask="0x00080000" name="TXCBDIS"/>
          <bitfield caption="Transfer Bus Error Clear" mask="0x01000000" name="ERRCLR"/>
        </register>
        <register caption="Transfer Status Register" name="EMAFE_PTSR" offset="0x124" rw="R" size="4">
          <bitfield caption="Receiver Transfer Enable" mask="0x00000001" name="RXTEN"/>
          <bitfield caption="Transmitter Transfer Enable" mask="0x00000100" name="TXTEN"/>
          <bitfield caption="Receiver Circular Buffer Enable" mask="0x00010000" name="RXCBEN"/>
          <bitfield caption="Transmitter Circular Buffer Enable" mask="0x00040000" name="TXCBEN"/>
          <bitfield caption="Transfer Bus Error" mask="0x01000000" name="ERR"/>
        </register>
        <register caption="Write Protection Mode Register" name="EMAFE_PWPMR" offset="0x128" rw="RW" size="4">
          <bitfield caption="Write Protection Pointer Registers Enable" mask="0x00000001" name="WPPTREN"/>
          <bitfield caption="Write Protection Counter Registers Enable" mask="0x00000002" name="WPCTREN"/>
          <bitfield caption="Write Protection Control Register Enable" mask="0x00000004" name="WPCREN"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="EMAFE_PWPMR__WPKEY"/>
        </register>
      </register-group>
