Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/PIC32CX-MTSH/atdf/PIC32CX1025MTSH128.atdf
        <register caption="Peripheral Clock Status Register 3" name="PMC_CSR3" offset="0x00B0" rw="R" size="4">
          <bitfield caption="Peripheral Clock 96 Status" mask="0x00000001" name="PID96"/>
        </register>
        <register caption="Generic Clock Status Register 0" name="PMC_GCSR0" offset="0x00C4" rw="R" size="4">
          <bitfield caption="Generic Clock 9 Status" mask="0x00000200" name="GPID9"/>
          <bitfield caption="Generic Clock 10 Status" mask="0x00000400" name="GPID10"/>
          <bitfield caption="Generic Clock 11 Status" mask="0x00000800" name="GPID11"/>
          <bitfield caption="Generic Clock 12 Status" mask="0x00001000" name="GPID12"/>
          <bitfield caption="Generic Clock 13 Status" mask="0x00002000" name="GPID13"/>
          <bitfield caption="Generic Clock 14 Status" mask="0x00004000" name="GPID14"/>
          <bitfield caption="Generic Clock 15 Status" mask="0x00008000" name="GPID15"/>
          <bitfield caption="Generic Clock 16 Status" mask="0x00010000" name="GPID16"/>
          <bitfield caption="Generic Clock 23 Status" mask="0x00800000" name="GPID23"/>
          <bitfield caption="Generic Clock 24 Status" mask="0x01000000" name="GPID24"/>
          <bitfield caption="Generic Clock 31 Status" mask="0x80000000" name="GPID31"/>
        </register>
        <register caption="Generic Clock Status Register 1" name="PMC_GCSR1" offset="0x00C8" rw="R" size="4">
          <bitfield caption="Generic Clock 34 Status" mask="0x00000004" name="GPID34"/>
          <bitfield caption="Generic Clock 37 Status" mask="0x00000020" name="GPID37"/>
        </register>
        <register caption="Generic Clock Status Register 2" name="PMC_GCSR2" offset="0x00CC" rw="R" size="4">
          <bitfield caption="Generic Clock 75 Status" mask="0x00000800" name="GPID75"/>
          <bitfield caption="Generic Clock 79 Status" mask="0x00008000" name="GPID79"/>
          <bitfield caption="Generic Clock 87 Status" mask="0x00800000" name="GPID87"/>
          <bitfield caption="Generic Clock 89 Status" mask="0x02000000" name="GPID89"/>
          <bitfield caption="Generic Clock 90 Status" mask="0x04000000" name="GPID90"/>
        </register>
        <register caption="Generic Clock Status Register 3" name="PMC_GCSR3" offset="0x00D0" rw="R" size="4">
          <bitfield caption="Generic Clock 96 Status" mask="0x00000001" name="GPID96"/>
        </register>
        <register caption="PLL Interrupt Enable Register" name="PMC_PLL_IER" offset="0x00E4" rw="W" size="4">
          <bitfield caption="PLL of Index 0 Lock Interrupt Enable" mask="0x00000001" name="LOCK0"/>
          <bitfield caption="PLL of Index 1 Lock Interrupt Enable" mask="0x00000002" name="LOCK1"/>
          <bitfield caption="PLL of Index 2 Lock Interrupt Enable" mask="0x00000004" name="LOCK2"/>
          <bitfield caption="PLL of Index 0 Unlock Interrupt Enable" mask="0x00010000" name="UNLOCK0"/>
          <bitfield caption="PLL of Index 1 Unlock Interrupt Enable" mask="0x00020000" name="UNLOCK1"/>
          <bitfield caption="PLL of Index 2 Unlock Interrupt Enable" mask="0x00040000" name="UNLOCK2"/>
        </register>
        <register caption="PLL Interrupt Disable Register" name="PMC_PLL_IDR" offset="0x00E8" rw="W" size="4">
          <bitfield caption="PLL of Index 0 Lock Interrupt Disable" mask="0x00000001" name="LOCK0"/>
          <bitfield caption="PLL of Index 1 Lock Interrupt Disable" mask="0x00000002" name="LOCK1"/>
          <bitfield caption="PLL of Index 2 Lock Interrupt Disable" mask="0x00000004" name="LOCK2"/>
          <bitfield caption="PLL of Index 0 Unlock Interrupt Disable" mask="0x00010000" name="UNLOCK0"/>
          <bitfield caption="PLL of Index 1 Unlock Interrupt Disable" mask="0x00020000" name="UNLOCK1"/>
          <bitfield caption="PLL of Index 2 Unlock Interrupt Disable" mask="0x00040000" name="UNLOCK2"/>
        </register>
        <register caption="PLL Interrupt Mask Register" name="PMC_PLL_IMR" offset="0x00EC" rw="R" size="4">
          <bitfield caption="PLL of Index 0 Lock Interrupt Mask" mask="0x00000001" name="LOCK0"/>
          <bitfield caption="PLL of Index 1 Lock Interrupt Mask" mask="0x00000002" name="LOCK1"/>
          <bitfield caption="PLL of Index 2 Lock Interrupt Mask" mask="0x00000004" name="LOCK2"/>
          <bitfield caption="PLL of Index 0 Unlock Interrupt Mask" mask="0x00010000" name="UNLOCK0"/>
          <bitfield caption="PLL of Index 1 Unlock Interrupt Mask" mask="0x00020000" name="UNLOCK1"/>
          <bitfield caption="PLL of Index 2 Unlock Interrupt Mask" mask="0x00040000" name="UNLOCK2"/>
        </register>
        <register caption="PLL Interrupt Status Register 0" name="PMC_PLL_ISR0" offset="0x00F0" rw="R" size="4">
          <bitfield caption="PLL of Index 0 Lock Interrupt Status" mask="0x00000001" name="LOCK0"/>
          <bitfield caption="PLL of Index 1 Lock Interrupt Status" mask="0x00000002" name="LOCK1"/>
          <bitfield caption="PLL of Index 2 Lock Interrupt Status" mask="0x00000004" name="LOCK2"/>
          <bitfield caption="PLL of Index 0 Unlock Interrupt Status" mask="0x00010000" name="UNLOCK0"/>
          <bitfield caption="PLL of Index 1 Unlock Interrupt Status" mask="0x00020000" name="UNLOCK1"/>
          <bitfield caption="PLL of Index 2 Unlock Interrupt Status" mask="0x00040000" name="UNLOCK2"/>
        </register>
        <register caption="PLL Interrupt Status Register 1" name="PMC_PLL_ISR1" offset="0x00F4" rw="R" size="4">
          <bitfield caption="PLLx Underflow" mask="0x00000001" name="UDR0"/>
          <bitfield caption="PLLx Underflow" mask="0x00000002" name="UDR1"/>
          <bitfield caption="PLLx Underflow" mask="0x00000004" name="UDR2"/>
          <bitfield caption="PLLx Overflow" mask="0x00010000" name="OVR0"/>
          <bitfield caption="PLLx Overflow" mask="0x00020000" name="OVR1"/>
          <bitfield caption="PLLx Overflow" mask="0x00040000" name="OVR2"/>
        </register>
      </register-group>
      <value-group caption="Coprocessor Clocks Enable Key" name="PMC_SCER__CPKEY">
        <value caption="This field must be written to 0xA to validate CPBMCK and CPCK." name="PASSWD" value="0xA"/>
      </value-group>
      <value-group caption="Coprocessor Clocks Enable Key" name="PMC_SCDR__CPKEY">
        <value caption="This field must be written to 0xA to validate CPBMCK and CPCK." name="PASSWD" value="0xA"/>
      </value-group>
      <value-group caption="Write Access Password" name="CKGR_MOR__KEY">
        <value caption="Writing any other value in this field aborts the write operation. Always reads as 0." name="PASSWD" value="0x37"/>
      </value-group>
      <value-group caption="Main Clock Oscillator Selection" name="CKGR_MOR__MOSCSEL">
        <value name="RC" caption="The main RC oscillator is selected." value="0"/>
        <value name="XT" caption="The main crystal oscillator is selected." value="1"/>
      </value-group>
      <value-group caption="Processor (CPU_CLK0) and Master Clock (MCK0) Source Selection" name="PMC_CPU_CKR__CSS">
        <value caption="MD_SLCK is selected" name="MD_SLOW_CLK" value="0x0"/>
        <value caption="MAINCK is selected" name="MAINCK" value="0x1"/>
        <value caption="PLLACK1 is selected" name="PLLACK1" value="0x2"/>
        <value caption="PLLBCK is selected" name="PLLBCK" value="0x3"/>
      </value-group>
