Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/PIC32CX-MTSH/atdf/PIC32CX1025MTSH128.atdf
        <register caption="Interrupt Mask Register" name="QSPI_IMR" offset="0x1C" rw="R" size="4">
          <bitfield caption="Receive Data Register Full Interrupt Mask" mask="0x00000001" name="RDRF"/>
          <bitfield caption="Transmit Data Register Empty Interrupt Mask" mask="0x00000002" name="TDRE"/>
          <bitfield caption="Transmission Registers Empty Mask" mask="0x00000004" name="TXEMPTY"/>
          <bitfield caption="Overrun Error Interrupt Mask" mask="0x00000008" name="OVRES"/>
          <bitfield caption="End of Receive Buffer Interrupt Mask" mask="0x00000010" name="ENDRX"/>
          <bitfield caption="End of Transmit Buffer Interrupt Mask" mask="0x00000020" name="ENDTX"/>
          <bitfield caption="Receive Buffer Full Interrupt Mask" mask="0x00000040" name="RXBUFF"/>
          <bitfield caption="Transmit Buffer Empty Interrupt Mask" mask="0x00000080" name="TXBUFE"/>
          <bitfield caption="Chip Select Rise Interrupt Mask" mask="0x00000100" name="CSR"/>
          <bitfield caption="Instruction End Interrupt Mask" mask="0x00000400" name="INSTRE"/>
          <bitfield caption="Last Write Access Interrupt Mask" mask="0x00000800" name="LWRA"/>
          <bitfield caption="QSPI Interrupt Fall Interrupt Mask" mask="0x00001000" name="QITF"/>
          <bitfield caption="QSPI Interrupt Rise Interrupt Mask" mask="0x00002000" name="QITR"/>
          <bitfield caption="Chip Select Fall Autoclear Interrupt Mask" mask="0x00004000" name="CSFA"/>
          <bitfield caption="Chip Select Rise Autoclear Interrupt Mask" mask="0x00008000" name="CSRA"/>
          <bitfield caption="QSPI Time-out Interrupt Mask" mask="0x00020000" name="TOUT"/>
        </register>
        <register caption="Serial Clock Register" name="QSPI_SCR" offset="0x20" rw="RW" size="4">
          <bitfield caption="Clock Polarity" mask="0x00000001" name="CPOL"/>
          <bitfield caption="Clock Phase" mask="0x00000002" name="CPHA"/>
          <bitfield caption="Delay Before QSCK" mask="0x00FF0000" name="DLYBS"/>
        </register>
        <register caption="Status Register" name="QSPI_SR" offset="0x24" rw="RW" size="4">
          <bitfield caption="Synchronization Busy" mask="0x00000001" name="SYNCBSY"/>
          <bitfield caption="QSPI Enable Status" mask="0x00000002" name="QSPIENS"/>
          <bitfield caption="Chip Select Status" mask="0x00000004" name="CSS"/>
          <bitfield caption="Read Busy" mask="0x00000008" name="RBUSY"/>
          <bitfield caption="QSPI Idle" mask="0x00000010" name="HIDLE"/>
        </register>
        <register caption="Instruction Address Register" name="QSPI_IAR" offset="0x30" rw="RW" size="4">
          <bitfield caption="Address" mask="0xFFFFFFFF" name="ADDR"/>
        </register>
        <register caption="Write Instruction Code Register" name="QSPI_WICR" offset="0x34" rw="RW" size="4">
          <bitfield caption="Write Instruction Code" mask="0x000000FF" name="WRINST"/>
          <bitfield caption="Write Option Code" mask="0x00FF0000" name="WROPT"/>
        </register>
        <register caption="Instruction Frame Register" name="QSPI_IFR" offset="0x38" rw="RW" size="4">
          <bitfield caption="Width of Instruction Code, Address, Option Code and Data" mask="0x0000000F" name="WIDTH" values="QSPI_IFR__WIDTH"/>
          <bitfield caption="Instruction Enable" mask="0x00000010" name="INSTEN"/>
          <bitfield caption="Address Enable" mask="0x00000020" name="ADDREN"/>
          <bitfield caption="Option Enable" mask="0x00000040" name="OPTEN"/>
          <bitfield caption="Data Enable" mask="0x00000080" name="DATAEN"/>
          <bitfield caption="Option Code Length" mask="0x00000300" name="OPTL" values="QSPI_IFR__OPTL"/>
          <bitfield caption="Address Length" mask="0x00000C00" name="ADDRL" values="QSPI_IFR__ADDRL"/>
          <bitfield caption="Data Transfer Type" mask="0x00001000" name="TFRTYP" values="QSPI_IFR__TFRTYP"/>
          <bitfield caption="Continuous Read Mode" mask="0x00004000" name="CRM" values="QSPI_IFR__CRM"/>
          <bitfield caption="DDR Mode Enable" mask="0x00008000" name="DDREN" values="QSPI_IFR__DDREN"/>
          <bitfield caption="Number Of Dummy Cycles" mask="0x001F0000" name="NBDUM"/>
          <bitfield caption="Serial Memory Register Mode" mask="0x00800000" name="SMRM"/>
          <bitfield caption="Peripheral BusTransfer Type" mask="0x01000000" name="APBTFRTYP"/>
          <bitfield caption="DQS Sampling Enable" mask="0x02000000" name="DQSEN"/>
          <bitfield caption="DDR Mode Command Enable" mask="0x04000000" name="DDRCMDEN" values="QSPI_IFR__DDRCMDEN"/>
          <bitfield caption="Protocol Type" mask="0x30000000" name="PROTTYP" values="QSPI_IFR__PROTTYP"/>
        </register>
        <register caption="Read Instruction Code Register" name="QSPI_RICR" offset="0x3C" rw="RW" size="4">
          <bitfield caption="Read Instruction Code" mask="0x000000FF" name="RDINST"/>
          <bitfield caption="Read Option Code" mask="0x00FF0000" name="RDOPT"/>
        </register>
        <register caption="Scrambling Mode Register" name="QSPI_SMR" offset="0x40" rw="RW" size="4">
          <bitfield caption="Scrambling/Unscrambling Enable" mask="0x00000001" name="SCREN" values="QSPI_SMR__SCREN"/>
          <bitfield caption="Scrambling/Unscrambling Random Value Disable" mask="0x00000002" name="RVDIS"/>
          <bitfield caption="Scrambling Key Lock" mask="0x00000004" name="SCRKL"/>
        </register>
        <register caption="Scrambling Key Register" name="QSPI_SKR" offset="0x44" rw="W" size="4">
          <bitfield caption="User Scrambling Key" mask="0xFFFFFFFF" name="USRK"/>
        </register>
        <register caption="Write Access Counter Register" name="QSPI_WRACNT" offset="0x54" rw="RW" size="4">
          <bitfield caption="Number of Write Accesses" mask="0xFFFFFFFF" name="NBWRA"/>
        </register>
        <register caption="Timeout Register" name="QSPI_TOUT" offset="0x64" rw="RW" size="4">
          <bitfield caption="Time-out Counter Maximum Value" mask="0x0000FFFF" name="TCNTM"/>
        </register>
        <register caption="Write Protection Mode Register" name="QSPI_WPMR" offset="0xE4" rw="RW" size="4">
          <bitfield caption="Write Protection Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protection Interrupt Enable" mask="0x00000002" name="WPITEN"/>
          <bitfield caption="Write Protection Control Register Enable" mask="0x00000004" name="WPCREN"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="QSPI_WPMR__WPKEY"/>
        </register>
        <register caption="Write Protection Status Register" name="QSPI_WPSR" offset="0xE8" rw="R" size="4">
          <bitfield caption="Write Protection Violation Status" mask="0x00000001" name="WPVS"/>
          <bitfield caption="Write Protection Violation Source" mask="0x0000FF00" name="WPVSRC"/>
        </register>
