Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/PIC32CX-MTSH/atdf/PIC32CX1025MTSH128.atdf
      <value-group caption="Wake-up Input Type 11" name="SUPC_WUIR__WKUPT11">
        <value caption="A falling edge followed by a low level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." name="LOW" value="0"/>
        <value caption="A rising edge followed by a high level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." name="HIGH" value="1"/>
      </value-group>
      <value-group caption="Wake-up Input Type 12" name="SUPC_WUIR__WKUPT12">
        <value caption="A falling edge followed by a low level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." name="LOW" value="0"/>
        <value caption="A rising edge followed by a high level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." name="HIGH" value="1"/>
      </value-group>
      <value-group caption="Wake-up Input Type 13" name="SUPC_WUIR__WKUPT13">
        <value caption="A falling edge followed by a low level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." name="LOW" value="0"/>
        <value caption="A rising edge followed by a high level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." name="HIGH" value="1"/>
      </value-group>
      <value-group caption="Wake-up Input Type 14" name="SUPC_WUIR__WKUPT14">
        <value caption="A falling edge followed by a low level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." name="LOW" value="0"/>
        <value caption="A rising edge followed by a high level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." name="HIGH" value="1"/>
      </value-group>
      <value-group caption="Timing Domain 32 kHz Oscillator Selection Status" name="SUPC_SR__TDOSCSEL">
        <value caption="The timing domain slow clock (TD_SLCK) source is the slow RC oscillator output." name="RC" value="0"/>
        <value caption="The timing domain slow clock source is the 32.768 kHz crystal oscillator output." name="XTAL" value="1"/>
      </value-group>
      <value-group caption="Slow Crystal Oscillator Frequency Monitor Status (cleared on read)" name="SUPC_SR__SXFMS">
        <value caption="No frequency error detected." name="GOOD" value="0x0"/>
        <value caption="The frequency has not been correct over 4 consecutive monitoring periods but there are still edges detected on the slow crystal oscillator output." name="FREQ_ERROR" value="0x1"/>
        <value caption="No edge detected in the slow crystal oscillator output for at least 2 consecutive monitoring periods." name="FAIL" value="0x2"/>
      </value-group>
      <value-group caption="Real-time Timer Wake-up Enable" name="SUPC_BMR__RTTWKEN">
        <value caption="The RTT alarm signal has no wake-up effect." name="DISABLE" value="0"/>
        <value caption="The RTT alarm signal forces the wake-up of the core power supply." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="Real-time Clock Wake-up Enable" name="SUPC_BMR__RTCWKEN">
        <value caption="The RTC alarm signal has no wake-up effect." name="DISABLE" value="0"/>
        <value caption="The RTC alarm signal forces the wake-up of the core power supply." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="VBAT Supply Monitor Wake-up Enable" name="SUPC_BMR__VBATWKEN">
        <value caption="Wake-up on VBAT supply monitor under voltage detection is disabled." name="DISABLE" value="0"/>
        <value caption="Wake-up on VBAT supply monitor under voltage detection is enabled." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="Force Wake-up Pin Wake-up Enable" name="SUPC_BMR__FWUPEN">
        <value caption="The fwup signal has no wake-up effect." name="DISABLE" value="0"/>
        <value caption="The fwup signal forces the wake-up of the core power supply." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="VDDCORE POR Wake-up Enable" name="SUPC_BMR__CORPORWKEN">
        <value caption="Wake-up on VDDCORE Power-On Reset Event is disabled." name="DISABLE" value="0"/>
        <value caption="Wake-up on VDDCORE Power-On Reset Event is enabled." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="VDD3V3 Supply Monitor Wake-up Enable" name="SUPC_BMR__VDD3V3SMWKEN">
        <value caption="Wake-up on VDD3V3 supply monitor under voltage detection is disabled." name="DISABLE" value="0"/>
        <value caption="Wake-up on VDD3V3 supply monitor under voltage detection is enabled." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="Battery Voltage Event Report Enable" name="SUPC_BMR__VBATREN">
        <value caption="Disables the report of event on VBAT voltage." name="DISABLE" value="0"/>
        <value caption="Enables the report of event on VBAT voltage." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="RTCOUT0 Outputs Drive Mode" name="SUPC_BMR__MRTCOUT">
        <value caption="RTCOUT0 output is driven according to the configuration of the field RTC_MR.OUT0." name="USERDEF" value="0"/>
      </value-group>
      <value-group caption="Password Key" name="SUPC_BMR__KEY">
        <value caption="Writing any other value in this field aborts the write operation." name="PASSWD" value="0xA5"/>
      </value-group>
    </module>
    <module caption="External Interrupt Controller" name="SYSCWP" id="04675" version="C">
      <register-group name="SYSCWP">
        <register caption="Write Protection Mode Register" name="SYSC_WPMR" offset="0x00" rw="RW" size="4">
          <bitfield caption="Write Protection Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protection Interrupt Enable" mask="0x00000002" name="WPITEN"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="SYSC_WPMR__WPKEY"/>
        </register>
        <register caption="Write Protection Status Register" name="SYSC_WPSR" offset="0x04" rw="R" size="4">
          <bitfield caption="Write Protection Register Violation Status" mask="0x00000001" name="WPVS"/>
          <bitfield caption="Write Violation Source" mask="0x0000FF00" name="WVSRC"/>
        </register>
      </register-group>
      <value-group caption="Write Protection Key" name="SYSC_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN and WPITEN bits. Always reads as 0." name="PASSWD" value="0x535943"/>
      </value-group>
    </module>
