Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/PIC32CX-MTSH/atdf/PIC32CX1025MTSH128.atdf
        <register name="ITATBCTR0" offset="0xEF8" rw="R" size="4" access-size="4" caption="ITATBCTR0">
          <bitfield name="ATREADY" caption="" mask="0x1"/>
        </register>
        <register name="FIFO1" offset="0xEFC" rw="R" size="4" access-size="4" caption="Integration ITM Data">
          <bitfield name="ITM0" caption="" mask="0xFF"/>
          <bitfield name="ITM1" caption="" mask="0xFF00"/>
          <bitfield name="ITM2" caption="" mask="0xFF0000"/>
          <bitfield name="ETM_bytecount" caption="" mask="0x3000000"/>
          <bitfield name="ETM_ATVALID" caption="" mask="0x4000000"/>
          <bitfield name="ITM_bytecount" caption="" mask="0x18000000"/>
          <bitfield name="ITM_ATVALID" caption="" mask="0x20000000"/>
        </register>
        <register name="ITCTRL" offset="0xF00" rw="RW" size="4" access-size="4" caption="Integration Mode Control">
          <bitfield name="Mode" caption="" mask="0x1"/>
        </register>
        <register name="CLAIMSET" offset="0xFA0" rw="RW" size="4" access-size="4" atomic-op="set:CLAIMSET" caption="Claim tag set">
        </register>
        <register name="CLAIMCLR" offset="0xFA4" rw="RW" size="4" access-size="4" atomic-op="clear:CLAIMCLR" caption="Claim tag clear">
        </register>
        <register name="DEVID" offset="0xFC8" rw="R" size="4" access-size="4" caption="TPIU_DEVID">
          <bitfield name="NrTraceInput" caption="" mask="0x1"/>
          <bitfield name="AsynClkIn" caption="" mask="0x20"/>
          <bitfield name="MinBufSz" caption="" mask="0x1C0"/>
          <bitfield name="PTINVALID" caption="" mask="0x200"/>
          <bitfield name="MANCVALID" caption="" mask="0x400"/>
          <bitfield name="NRZVALID" caption="" mask="0x800"/>
        </register>
        <register name="DEVTYPE" offset="0xFCC" rw="R" size="4" access-size="4" caption="TPIU_DEVTYPE">
          <bitfield name="SubType" caption="" mask="0xF"/>
          <bitfield name="MajorType" caption="" mask="0xF0"/>
        </register>
      </register-group>
    </module>
  </modules>
  <pinouts>
    <pinout name="TQFP128">
      <pin position="16" pad="IN2"/>
      <pin position="17" pad="IP2"/>
      <pin position="27" pad="PA2"/>
      <pin position="28" pad="PA3"/>
      <pin position="29" pad="PA4"/>
      <pin position="30" pad="PA5"/>
      <pin position="31" pad="PA6"/>
      <pin position="32" pad="PA7"/>
      <pin position="5" pad="PA8"/>
      <pin position="6" pad="PA9"/>
      <pin position="25" pad="PA10"/>
      <pin position="26" pad="PA11"/>
      <pin position="37" pad="PA12"/>
      <pin position="38" pad="PA13"/>
      <pin position="39" pad="PA14"/>
      <pin position="40" pad="PA15"/>
      <pin position="33" pad="PA16"/>
      <pin position="34" pad="PA17"/>
      <pin position="35" pad="PA18"/>
      <pin position="36" pad="PA19"/>
      <pin position="46" pad="PA20"/>
      <pin position="63" pad="PA21"/>
      <pin position="64" pad="PA22"/>
      <pin position="65" pad="PA23"/>
      <pin position="66" pad="PA24"/>
      <pin position="67" pad="PA25"/>
      <pin position="68" pad="PA26"/>
      <pin position="69" pad="PA27"/>
      <pin position="70" pad="PA28"/>
      <pin position="71" pad="PA29"/>
      <pin position="72" pad="PA30"/>
      <pin position="74" pad="PB1"/>
      <pin position="75" pad="PB0"/>
      <pin position="76" pad="PB2"/>
      <pin position="77" pad="PA31"/>
      <pin position="81" pad="PB3"/>
      <pin position="82" pad="PB4"/>
      <pin position="83" pad="PB5"/>
      <pin position="84" pad="PB6"/>
      <pin position="85" pad="PB7"/>
      <pin position="86" pad="PB8"/>
      <pin position="87" pad="PB9"/>
      <pin position="88" pad="PB10"/>
      <pin position="89" pad="PB11"/>
      <pin position="90" pad="PB12"/>
      <pin position="91" pad="PB13"/>
      <pin position="92" pad="PB14"/>
      <pin position="93" pad="PB15"/>
      <pin position="94" pad="PB16"/>
      <pin position="95" pad="PB17"/>
      <pin position="96" pad="PB18"/>
      <pin position="97" pad="PB19"/>
      <pin position="98" pad="PB20"/>
      <pin position="99" pad="VDDBLOW"/>
      <pin position="100" pad="PB22"/>
      <pin position="101" pad="PB23"/>
      <pin position="102" pad="PB24"/>
      <pin position="103" pad="PB25"/>
      <pin position="104" pad="PB26"/>
      <pin position="105" pad="PC0"/>
      <pin position="106" pad="PC1"/>
      <pin position="109" pad="PC2"/>
      <pin position="110" pad="PC3"/>
      <pin position="111" pad="VDDIN_AFE"/>
      <pin position="112" pad="PC5"/>
      <pin position="113" pad="PC6"/>
      <pin position="114" pad="PC7"/>
      <pin position="115" pad="PC8"/>
      <pin position="116" pad="PC9"/>
      <pin position="118" pad="PC10"/>
      <pin position="119" pad="PC11"/>
      <pin position="121" pad="PC12"/>
      <pin position="122" pad="PC13"/>
      <pin position="123" pad="PC14"/>
      <pin position="124" pad="PC15"/>
      <pin position="125" pad="PC16"/>
      <pin position="126" pad="PC17"/>
      <pin position="127" pad="PC18"/>
      <pin position="128" pad="PC19"/>
      <pin position="1" pad="PC20"/>
      <pin position="2" pad="PC21"/>
      <pin position="3" pad="PC22"/>
      <pin position="4" pad="PD0"/>
      <pin position="42" pad="PD1"/>
      <pin position="43" pad="PD2"/>
      <pin position="7" pad="PD3"/>
      <pin position="8" pad="VP2"/>
      <pin position="9" pad="VP1"/>
      <pin position="10" pad="VN"/>
      <pin position="11" pad="GNDREF"/>
      <pin position="12" pad="GNDA"/>
      <pin position="13" pad="VDDA"/>
      <pin position="14" pad="VREF_AFE"/>
      <pin position="15" pad="MUXANA"/>
      <pin position="44" pad="PD12"/>
      <pin position="45" pad="PD13"/>
      <pin position="18" pad="IN1"/>
      <pin position="19" pad="IP1"/>
      <pin position="20" pad="PD16"/>
      <pin position="22" pad="PD17"/>
      <pin position="23" pad="PD18"/>
      <pin position="24" pad="PD19"/>
      <pin position="57" pad="FWUP"/>
      <pin position="49" pad="NRST"/>
      <pin position="53" pad="WKUP2_TMP2"/>
      <pin position="47" pad="VDDOUT"/>
      <pin position="54" pad="WKUP1_TMP1"/>
      <pin position="52" pad="VBAT"/>
      <pin position="58" pad="JTAGSEL"/>
      <pin position="50" pad="VDDCORE"/>
      <pin position="62" pad="SDHN"/>
      <pin position="55" pad="WKUP0_TMP0"/>
      <pin position="48" pad="VDD3V3"/>
      <pin position="51" pad="VDD3V3"/>
      <pin position="61" pad="TST"/>
      <pin position="56" pad="RTCOUT0"/>
      <pin position="41" pad="VDDCORE"/>
      <pin position="21" pad="VDD3V3"/>
      <pin position="60" pad="XOUT32"/>
      <pin position="59" pad="XIN32"/>
      <pin position="73" pad="VREFP"/>
      <pin position="78" pad="VDDPLL"/>
      <pin position="79" pad="VDDLCD"/>
      <pin position="80" pad="VDD3V3"/>
      <pin position="107" pad="VDDCORE"/>
      <pin position="108" pad="VDDIO_AFE"/>
      <pin position="117" pad="VDDCORE"/>
      <pin position="120" pad="VDD3V3"/>
    </pinout>
  </pinouts>
</avr-tools-device-file>
